Repository: Digoblon/UserAnimeList
Catalog: src/Shared/UserAnimeList.Exception/ResourceMessagesException.*.resx
Languages: ja, pt

# EMAIL_ALREADY_REGISTERED
source: Email already registered on the platform.
ja: このメールアドレスはすでに登録されています。
pt: Este e-mail já está cadastrado na plataforma.

# USERNAME_ALREADY_REGISTERED
source: Username already registered on the platform.
ja: このユーザー名はすでに登録されています。
pt: Este nome de usuário já está cadastrado na plataforma.

# EMAIL_EMPTY
source: The email cannot be empty.
ja: メールアドレスは必須です。
pt: O e-mail não pode estar vazio.

# EMAIL_INVALID
source: The email is invalid.
ja: メールアドレスの形式が正しくありません。
pt: Endereço de e-mail inválido.

# EMAIL_OR_PASSWORD_INVALID
source: Invalid e-mail and/or password.
ja: メールアドレスまたはパスワードが無効です。
pt: E-mail e/ou senha inválidos.

# EXPIRED_SESSION
source: Your session has expired. Please log in again to continue.
ja: セッションの有効期限が切れています。続行するには再度サインインしてください。
pt: Sua sessão expirou. Faça login novamente para continuar.

# INVALID_PASSWORD
source: Password must be between 6 - 50 characters long and contain at least three of the following: uppercase, lowercase, numbers and symbols..
ja: パスワードは6〜50文字で、英大文字・英小文字・数字・記号のうち3種類以上を含める必要があります。
pt: A senha deve ter de 6 a 50 caracteres e conter ao menos três dos seguintes grupos: letras maiúsculas, letras minúsculas, números e símbolos.

# INVALID_SESSION
source: We couldn't find a valid session. Please log in to access this feature.
ja: 有効なセッションが見つかりません。機能を利用するにはログインしてください。
pt: Não foi possível localizar uma sessão válida. Faça login para acessar este recurso.

# NAME_EMPTY
source: The name cannot be empty.
ja: 名前は必須です。
pt: O nome não pode estar vazio.

# NO_TOKEN
source: Authentication token was not provided.
ja: 認証トークンが提供されていません。
pt: O token de autenticação não foi fornecido.

# ONLY_IMAGES_ACCEPTED
source: Only images (PNG, JPG, JPEG) are accepted.
ja: PNG、JPG、JPEG、WEBP形式の画像のみ受け付けています。
pt: Apenas imagens PNG, JPG, JPEG e WEBP são aceitas.

# PASSWORD_DIFFERENT_CURRENT_PASSWORD
source: The password entered is different from the current password.
ja: 入力されたパスワードが現在のパスワードと一致しません。
pt: A senha informada não corresponde à senha atual.

# PASSWORD_EMPTY
source: The password cannot be empty.
ja: パスワードは必須です。
pt: A senha não pode estar vazia.

source: Unknown error.
ja: 不明なエラーが発生しました。
pt: Ocorreu um erro desconhecido.

# INVALID_JSON
source: Invalid JSON format.
ja: JSON形式が無効です。
pt: Formato JSON inválido.

# INVALID_REQUEST_BODY
source: Request body is invalid or missing.
ja: リクエストボディが無効か、存在しません。
pt: O corpo da requisição é inválido ou está ausente.

# NAME_INVALID_FORMAT
source: Please enter a valid username (letters, numbers, underscores and dashes only).
ja: 有効なユーザー名を入力してください（英字、数字、アンダースコア、ハイフンのみ）。
pt: Informe um nome de usuário válido (apenas letras, números, sublinhados e hífens).

# LOGIN_OR_PASSWORD_INVALID
source: Your username or password is incorrect.
ja: ユーザー名またはパスワードが正しくありません。
pt: Nome de usuário ou senha incorretos.

# PASSWORDS_NOT_MATCH
source: The passwords does not match.
ja: パスワードが一致しません。
pt: As senhas não coincidem.

# INVALID_TOKEN
source: Authentication token is invalid.
ja: 認証トークンが無効です。
pt: Token de autenticação inválido.

source: Token expired.
ja: トークンの有効期限が切れています。
pt: O token expirou.

# NO_ACCESS
source: User has no access.
ja: ユーザーにアクセス権がありません。
pt: O usuário não possui acesso.

# USER_NOT_FOUND
source: User not found in database.
ja: データベースにユーザーが見つかりません。
pt: Usuário não encontrado no banco de dados.

# WRONG_TOKEN_VERSION
source: Token version mismatch
ja: トークンのバージョンが一致しません。
pt: Incompatibilidade na versão do token.

# USER_HAS_NO_ACCESS
source: The user has no access.
ja: ユーザーにアクセス権がありません。
pt: O usuário não possui acesso.

source: Invalid role claim.
ja: ロールクレームが無効です。
pt: Claim de perfil inválida.

# STUDIO_ALREADY_REGISTERED
source: The Studio is already registered.
ja: このスタジオはすでに登録されています。
pt: Este estúdio já está cadastrado.

source: Studio not found.
ja: スタジオが見つかりません。
pt: Estúdio não encontrado.

# INVALID_ID
source: Invalid Id format.
ja: IDの形式が無効です。
pt: Formato de ID inválido.

# GENRE_ALREADY_REGISTERED
source: This genre is already registered.
ja: このジャンルはすでに登録されています。
pt: Este gênero já está cadastrado.

# EPISODE_COUNT_INVALID
source: Invalid episode count.
ja: 話数が無効です。
pt: Quantidade de episódios inválida.

# STATUS_NOT_SUPPORTED
source: Anime status entered is not valid.
ja: 指定されたアニメのステータスは無効です。
pt: O status de anime informado é inválido.

# SOURCE_NOT_SUPPORTED
source: Anime source type entered is not valid.
ja: 指定されたアニメの原作種別は無効です。
pt: O tipo de origem do anime informado é inválido.

# TYPE_NOT_SUPPORTED
source: Anime type entered is not valid.
ja: 指定されたアニメのタイプは無効です。
pt: O tipo de anime informado é inválido.

# DUPLICATED_GENRES
source: One or more genre is duplicated.
ja: 重複したジャンルが含まれています。
pt: Um ou mais gêneros estão duplicados.

# DUPLICATED_STUDIOS
source: One or more studio is duplicated.
ja: 重複したスタジオが含まれています。
pt: Um ou mais estúdios estão duplicados.

# ANIME_EXCEEDS_LIMIT
source: The anime name exceeds the limit of 256 characters
ja: アニメ名は256文字以内で入力してください。
pt: O nome do anime excede o limite de 256 caracteres.

# ANIME_AIRED_UNTIL_EARLY_FROM
source: The anime aired until cannot be earlier than aired from
ja: 「放送終了日」は「放送開始日」より前にできません。
pt: A data de "exibição até" não pode ser anterior à data de "exibição de".

# ANIME_AIRED_UNTIL_FILLED_AIRED_FROM_NOT_FILLED
source: When aired until is specified aired from must also be provided.
ja: 「放送終了日」を指定する場合は、「放送開始日」も指定してください。
pt: Quando "exibição até" for informado, "exibição de" também deve ser informado.

# EPISODE_MUST_BE_SPECIFIED
source: When anime is finished the anime episodes must be specified.
ja: アニメのステータスが「完了」の場合、話数の指定が必要です。
pt: Quando o status do anime for "finalizado", a quantidade de episódios deve ser informada.

# GENRES_CANNOT_BE_NULL
source: Genres for the anime cannot be null.
ja: アニメのジャンルはnullにできません。
pt: Os gêneros do anime não podem ser nulos.

# STUDIOS_CANNOT_BE_NULL
source: Studios for the anime cannot be null.
ja: アニメのスタジオはnullにできません。
pt: Os estúdios do anime não podem ser nulos.

# ANIME_AIRED_FROM_REQUIRED_WHEN_FINISHED
source: When the anime status is finished the aired from must be specified.
ja: アニメのステータスが「完了」の場合、「放送開始日」は必須です。
pt: Quando o status do anime for "finalizado", "exibição de" deve ser informado.

# ANIME_AIRED_UNTIL_REQUIRED_WHEN_FINISHED
source: When the anime status is finished the aired until must be specified.
ja: アニメのステータスが「完了」の場合、「放送終了日」は必須です。
pt: Quando o status do anime for "finalizado", "exibição até" deve ser informado.

# ANIME_AIRED_FROM_REQUIRED_WHEN_AIRING
source: When the anime status is airing the aired from must be specified.
ja: アニメのステータスが「放送中」の場合、「放送開始日」は必須です。
pt: Quando o status do anime for "em exibição", "exibição de" deve ser informado.

# ANIME_ALREADY_REGISTERED
source: An anime with this name is already registered.
ja: この名前のアニメはすでに登録されています。
pt: Já existe um anime cadastrado com este nome.

# INVALID_STUDIOS_IN_REQUEST
source: The following studios entered are invalid:
ja: 以下のスタジオは無効です:
pt: Os seguintes estúdios são inválidos:

# INVALID_GENRES_IN_REQUEST
source: The following genres entered are invalid:
ja: 以下のジャンルは無効です:
pt: Os seguintes gêneros são inválidos:

# ANIME_NOT_FOUND
source: The specified anime is not found.
ja: 指定されたアニメが見つかりませんでした。
pt: O anime informado não foi encontrado.

# GENRE_NOT_FOUND
source: The specified genre was not found.
ja: 指定されたジャンルが見つかりませんでした。
pt: O gênero informado não foi encontrado.

# SYNOPSIS_EXCEEDS_LIMIT
source: The specified synopsis exceeds the maximum character length of 5000.
ja: あらすじは最大5,000文字までです。
pt: A sinopse excede o limite máximo de 5.000 caracteres.

# ANIME_LIST_DATE_FINISHED_EARLIER_DATE_STARTED
source: The date finished cannot be earlier than date started.
ja: 終了日は開始日より前にできません。
pt: A data de término não pode ser anterior à data de início.

# ANIME_LIST_SCORE_INVALID
source: The anime score must be between 1 and 10.
ja: アニメのスコアは1〜10の範囲で指定してください。
pt: A pontuação do anime deve estar entre 1 e 10.

# ANIME_LIST_INVALID_STATUS
source: The status for the anime is invalid.
ja: アニメのステータスが無効です。
pt: O status do anime é inválido.

# ANIME_LIST_ENTRY_ALREADY_EXISTS
source: This anime list entry already exists.
ja: このアニメリスト項目はすでに存在します。
pt: Este item já existe na lista de animes.

# ANIME_LIST_INVALID
source: Anime list invalid or not found.
ja: アニメリストが無効か、見つかりません。
pt: A lista de animes é inválida ou não foi encontrada.
